Revit 2018 API
Rebar.SetLayoutAsMinimumClearSpacing Method
 Sets the Layout Rule property of rebar set to MinimumClearSpacing
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2009
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().SetLayoutAsMinimumClearSpacing() instead.")]
public void SetLayoutAsMinimumClearSpacing(
	double spacing,
	double arrayLength,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().SetLayoutAsMinimumClearSpacing() instead.")> _
Public Sub SetLayoutAsMinimumClearSpacing ( _
	spacing As Double, _
	arrayLength As Double, _
	barsOnNormalSide As Boolean, _
	includeFirstBar As Boolean, _
	includeLastBar As Boolean _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().SetLayoutAsMinimumClearSpacing() instead.")]
public:
void SetLayoutAsMinimumClearSpacing(
	double spacing,
	double arrayLength,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
Parameters
spacing
Type: System.Double
 The maximum spacing between rebar in rebar set
arrayLength
Type: System.Double
 The distribution length of rebar set
barsOnNormalSide
Type: System.Boolean
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar
Type: System.Boolean
 Identifies if the first bar in rebar set is shown
includeLastBar
Type: System.Boolean
 Identifies if the last bar in rebar set is shown
Remarks
 When changing the layout rule to MinimumClearSpacing, you must also simultaneously set Spacing, SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The spacing isn't bigger than 0.0. -or- the set length arrayLength isn't acceptable.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InapplicableDataException |  This Rebar is an instance of a spiral or multiplanar shape.
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace